In [1]:
%matplotlib inline
%config InlineBackend.figure_format='retina'

import pandas as pd
from sklearn import linear_model
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('test.csv', sep=';')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
creation_date    10 non-null object
nom              10 non-null object
age              10 non-null int64
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [4]:
data.set_index('creation_date', inplace=True)
data.loc['2017-01-02']

nom    kim111
age        34
Name: 2017-01-02, dtype: object

In [5]:
data.values

array([['julien', 37],
       ['kim111', 34],
       ['kim22', 34],
       ['kim33', 35],
       ['kim44', 34],
       ['kim55', 32],
       ['kim66', 38],
       ['kim77', 32],
       ['kim88', 35],
       ['kim99', 33]], dtype=object)

In [6]:
data.columns

Index(['nom', 'age'], dtype='object')

In [7]:
data.index

Index(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04', '2017-01-05',
       '2017-01-06', '2017-01-07', '2017-01-08', '2017-01-09', '2017-01-10'],
      dtype='object', name='creation_date')

In [8]:
data.head()

                  nom  age
creation_date
2017-01-01     julien   37
2017-01-02     kim111   34
2017-01-03      kim22   34
2017-01-04      kim33   35
2017-01-05      kim44   34

In [9]:
data.tail()

                 nom  age
creation_date
2017-01-06     kim55   32
2017-01-07     kim66   38
2017-01-08     kim77   32
2017-01-09     kim88   35
2017-01-10     kim99   33

In [10]:
data.shape

(10, 2)

In [11]:
data.keys

<bound method NDFrame.keys of                   nom  age
creation_date
2017-01-01     julien   37
2017-01-02     kim111   34
2017-01-03      kim22   34
2017-01-04      kim33   35
2017-01-05      kim44   34
2017-01-06      kim55   32
2017-01-07      kim66   38
2017-01-08      kim77   32
2017-01-09      kim88   35
2017-01-10      kim99   33>

In [12]:
len(data)

10

In [13]:
data.describe()

            age
count  10.00000
mean   34.40000
std     1.95505
min    32.00000
25%    33.25000
50%    34.00000
75%    35.00000
max    38.00000

In [14]:
data.age

creation_date
2017-01-01    37
2017-01-02    34
2017-01-03    34
2017-01-04    35
2017-01-05    34
2017-01-06    32
2017-01-07    38
2017-01-08    32
2017-01-09    35
2017-01-10    33
Name: age, dtype: int64

In [15]:
data.ix[3]

nom    kim33
age       35
Name: 2017-01-04, dtype: object

In [16]:
data.loc['2017-01-03':'2017-01-05']

                 nom  age
creation_date
2017-01-03     kim22   34
2017-01-04     kim33   35
2017-01-05     kim44   34

In [17]:
plt.scatter(data.loc['2017-01-03':'2017-01-05'])

TypeError: scatter() missing 1 required positional argument: 'y'

In [ ]:
data.index.values